#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_security_group.allow_5432: Refreshing state... [id=sg-00146638977b9f8dc]
aws_vpc_security_group_ingress_rule.allow_ingress_5432: Refreshing state... [id=sgr-0c0647e7620fc928e]
aws_db_instance.climate: Refreshing state... [id=db-FRWD4BKFF4THTAGHZDARGIT56U]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.current_air_quality will be created
  + resource "aws_ecr_repository" "current_air_quality" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "c18-climate-monitor-current-air-quality-ecr"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.current_reading_orchestrator will be created
  + resource "aws_ecr_repository" "current_reading_orchestrator" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "c18-climate-monitor-current-reading-orchestrator-ecr"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.current_weather will be created
  + resource "aws_ecr_repository" "current_weather" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "c18-climate-monitor-current-weather-ecr"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.daily_summary will be created
  + resource "aws_ecr_repository" "daily_summary" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "c18-climate-monitor-daily-summary-ecr"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.dashboard will be created
  + resource "aws_ecr_repository" "dashboard" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "c18-climate-monitor-dashboard-ecr"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.flood_warning_check will be created
  + resource "aws_ecr_repository" "flood_warning_check" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "c18-climate-monitor-flood-warning-check-ecr"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.future_predictions will be created
  + resource "aws_ecr_repository" "future_predictions" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "c18-climate-monitor-future-predictions-ecr"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.historic_air_quality will be created
  + resource "aws_ecr_repository" "historic_air_quality" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "c18-climate-monitor-historic-air-quality-ecr"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.historic_weather will be created
  + resource "aws_ecr_repository" "historic_weather" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "c18-climate-monitor-historic-weather-ecr"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.new_location_orchestrator will be created
  + resource "aws_ecr_repository" "new_location_orchestrator" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "c18-climate-monitor-new-location-orchestrator-ecr"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @lindengraves, Action: `pull_request`*